In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

pd.options.display.float_format = '{.1f}'.format

In [2]:
df = pd.read_csv('US_baby_names.csv')
print(df.shape)
df

(2052781, 4)

         Year      Names Gender  Count
0        1880       Mary      F   7065
1        1880       Anna      F   2604
2        1880       Emma      F   2003
3        1880  Elizabeth      F   1939
4        1880     Minnie      F   1746
...       ...        ...    ...    ...
2052776  2021     Zyeire      M      5
2052777  2021       Zyel      M      5
2052778  2021      Zyian      M      5
2052779  2021      Zylar      M      5
2052780  2021        Zyn      M      5

[2052781 rows x 4 columns]

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2052781 entries, 0 to 2052780
Data columns (total 4 columns):
 #   Column  Dtype
---  ------  -----
 0   Year    int64
 1   Names   object
 2   Gender  object
 3   Count   int64
dtypes: int64(2), object(2)
memory usage: 62.6+ MB

In [4]:
df.nunique()

Year         142
Names     101338
Gender         2
Count      13854
dtype: int64

In [5]:
# Because gender has only two values we opt to change it to 'category'

df.Gender = df.Gender.astype('category')

In [7]:
# This step made the memory reduce from 62.6 mb to 48.9 mb

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2052781 entries, 0 to 2052780
Data columns (total 4 columns):
 #   Column  Dtype
---  ------  -----
 0   Year    int64
 1   Names   object
 2   Gender  category
 3   Count   int64
dtypes: category(1), int64(2), object(1)
memory usage: 48.9+ MB

In [8]:
# Inspecting the most popular names in 2021

df_2021 = df[df.Year == 2021].copy()
df_2021

         Year      Names Gender  Count
2021244  2021     Olivia      F  17728
2021245  2021       Emma      F  15433
2021246  2021  Charlotte      F  13285
2021247  2021     Amelia      F  12952
2021248  2021        Ava      F  12759
...       ...        ...    ...    ...
2052776  2021     Zyeire      M      5
2052777  2021       Zyel      M      5
2052778  2021      Zyian      M      5
2052779  2021      Zylar      M      5
2052780  2021        Zyn      M      5

[31537 rows x 4 columns]